/**
 * メッセージデータ - 自己紹介
 */
export const SELF_INTRODUCTION = {
  content: (
    <>
      <p className='mb-6'>
        初めましてAIと申します。簡単ですが自己紹介をさせてください。
      </p>
      <p className='mb-6'>
        私はフロントエンドエンジニアとして現在働いております。
        <br />
        5年程化粧品業界で接客から営業、企画を経て現在IT業界へ転職し7年になりました。
        <br />
        そしてリモートワークの普及や子供が生まれた事もあり、意を決して2年前に北海道に移住を決意！
        幸いな事にフルリモートの案件を頂く事が出来、子供との時間も増え、非常に充実した生活を送っております。
      </p>
    </>
  ),
};

/**
 * メッセージデータ - QA項目
 */
export const QAITEMS = [
  {
    question: '化粧品業界から何故エンジニアへの転職をしたのか？',
    answer:
      '自分が担当になった商品が＠コスメによって大ヒットし、売上が急増した事でネットでの宣伝の重要性を痛感しました。それから独学でHTML/CSS/JavaScriptを学び、プログラミングの楽しさに目覚め、もっと深く学びたいと思い、転職を決意しました。',
  },
  {
    question: '1日PCに向かう仕事になって辛い？',
    answer:
      'お客様との接客はとても大好きですが、ゲームが大好きな事もあり1日15時間ぶっ通しでやっていた経験もある為、画面を見続けて作業する事にさほど抵抗はありませんでした。',
  },
  {
    question: '北海道への移住',
    answer:
      '仕事で1回しか言った事なく無謀だと皆からいわれました（笑）私自身仕事も出来なくなるのでは？と心配もありましたが、近年リモートの敷居も下がり、子育てしやすい環境に住みたいという思いが強くなり主人の地元である北海道の移住へ踏み切りました！',
  },
];
